validation/oneWayCoupledVdfTransportFoam/spray1D/biModal_nonLinear/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

setFormat raw;

surfaceFormat vtk;

interpolationScheme cell;

// Fields to sample.
fields
(
    alpha.liquid        //1
    U.liquid            //2
    U.gas               //3
    moment.000.liquid   //4
    moment.100.liquid   //5
    moment.200.liquid   //6
    moment.300.liquid   //7
);


sets
(
    Centerline
    {
        type        lineCell;
        axis        x;

        start       (0.05 0.01 0);
        end         (0.25 0.01 0);
    }
);


surfaces ();

// *********************************************************************** //
